import React from 'react';
import Loader from "../Hooks/Loader";

const PolicyPage = () => {
    Loader()

    return (
        <section className="section-terms">
            <div className="section-terms__top">
                <h1>Пользовательское соглашение</h1>
                <img src="../images/terms.png" alt="Photo" />
            </div>
            <div className="section-terms__content">
                <h2>Правила для пользователя</h2>
                <p>1. ОБЩИЕ УСЛОВИЯ</p>
                <p>1.1. НАСТОЯЩЕЕ СОГЛАШЕНИЕ ЯВЛЯЕТСЯ ПУБЛИЧНОЙ ОФЕРТОЙ. ПОЛУЧАЯ ДОСТУП К МАТЕРИАЛАМ САЙТА ПОЛЬЗОВАТЕЛЬ
                    СЧИТАЕТСЯ ПРИСОЕДИНИВШИМСЯ К НАСТОЯЩЕМУ СОГЛАШЕНИЮ.</p>
                <p>1.2. АДМИНИСТРАЦИЯ САЙТА ВПРАВЕ В ЛЮБОЕ ВРЕМЯ В ОДНОСТОРОННЕМ ПОРЯДКЕ ИЗМЕНЯТЬ УСЛОВИЯ НАСТОЯЩЕГО
                    СОГЛАШЕНИЯ. ТАКИЕ ИЗМЕНЕНИЯ ВСТУПАЮТ В СИЛУ ПО ИСТЕЧЕНИИ 3 (ТРЕХ) ДНЕЙ С МОМЕНТА РАЗМЕЩЕНИЯ НОВОЙ
                    ВЕРСИИ СОГЛАШЕНИЯ НА САЙТЕ. ПРИ НЕСОГЛАСИИ ПОЛЬЗОВАТЕЛЯ
                    С ВНЕСЕННЫМИ ИЗМЕНЕНИЯМИ ОН ОБЯЗАН ОТКАЗАТЬСЯ ОТ ДОСТУПА К САЙТУ, ПРЕКРАТИТЬ ИСПОЛЬЗОВАНИЕ
                    МАТЕРИАЛОВ И СЕРВИСОВ САЙТА.</p>
                <p>2. ОБЯЗАТЕЛЬСТВА ПОЛЬЗОВАТЕЛЯ</p>
                <p>2.1. ИСПОЛЬЗОВАНИЕ МАТЕРИАЛОВ САЙТА БЕЗ СОГЛАСИЯ ПРАВООБЛАДАТЕЛЕЙ НЕ ДОПУСКАЕТСЯ. ДЛЯ ПРАВОМЕРНОГО
                    ИСПОЛЬЗОВАНИЯ МАТЕРИАЛОВ САЙТА НЕОБХОДИМО ЗАКЛЮЧЕНИЕ ЛИЦЕНЗИОННЫХ ДОГОВОРОВ (ПОЛУЧЕНИЕ ЛИЦЕНЗИЙ) ОТ
                    ПРАВООБЛАДАТЕЛЕЙ.</p>
                <p>2.2. ПРИ ЦИТИРОВАНИИ МАТЕРИАЛОВ САЙТА, ВКЛЮЧАЯ ОХРАНЯЕМЫЕ АВТОРСКИЕ ПРОИЗВЕДЕНИЯ, ССЫЛКА НА САЙТ
                    ОБЯЗАТЕЛЬНА</p>
                <p>2.3. ПОЛЬЗОВАТЕЛЬ ПРЕДУПРЕЖДЕН О ТОМ, ЧТО АДМИНИСТРАЦИЯ САЙТА НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА ПОСЕЩЕНИЕ И
                    ИСПОЛЬЗОВАНИЕ ИМ ВНЕШНИХ РЕСУРСОВ, ССЫЛКИ НА КОТОРЫЕ МОГУТ СОДЕРЖАТЬСЯ НА САЙТЕ.</p>
                <p>2.4. ПОЛЬЗОВАТЕЛЬ СОГЛАСЕН С ТЕМ, ЧТО АДМИНИСТРАЦИЯ САЙТА НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ И НЕ ИМЕЕТ ПРЯМЫХ
                    ИЛИ КОСВЕННЫХ ОБЯЗАТЕЛЬСТВ ПЕРЕД ПОЛЬЗОВАТЕЛЕМ В СВЯЗИ С ЛЮБЫМИ ВОЗМОЖНЫМИ ИЛИ ВОЗНИКШИМИ ПОТЕРЯМИ
                    ИЛИ УБЫТКАМИ, СВЯЗАННЫМИ С ЛЮБЫМ СОДЕРЖАНИЕМ
                    САЙТА, РЕГИСТРАЦИЕЙ АВТОРСКИХ ПРАВ И СВЕДЕНИЯМИ О ТАКОЙ РЕГИСТРАЦИИ, ТОВАРАМИ ИЛИ УСЛУГАМИ,
                    ДОСТУПНЫМИ НА ИЛИ ПОЛУЧЕННЫМИ ЧЕРЕЗ ВНЕШНИЕ САЙТЫ ИЛИ РЕСУРСЫ ЛИБО ИНЫЕ КОНТАКТЫ ПОЛЬЗОВАТЕЛЯ, В
                    КОТОРЫЕ ОН ВСТУПИЛ, ИСПОЛЬЗУЯ РАЗМЕЩЕННУЮ НА САЙТЕ ИНФОРМАЦИЮ
                    ИЛИ ССЫЛКИ НА ВНЕШНИЕ РЕСУРСЫ.</p>
                <p>2.5. ПОЛЬЗОВАТЕЛЬ ПРИНИМАЕТ ПОЛОЖЕНИЕ О ТОМ, ЧТО ВСЕ МАТЕРИАЛЫ И СЕРВИСЫ САЙТА ИЛИ ЛЮБАЯ ИХ ЧАСТЬ
                    МОГУТ СОПРОВОЖДАТЬСЯ РЕКЛАМОЙ. ПОЛЬЗОВАТЕЛЬ СОГЛАСЕН С ТЕМ, ЧТО АДМИНИСТРАЦИЯ САЙТА НЕ НЕСЕТ
                    КАКОЙ-ЛИБО ОТВЕТСТВЕННОСТИ И НЕ ИМЕЕТ КАКИХ-ЛИБО ОБЯЗАТЕЛЬСТВ
                    В СВЯЗИ С ТАКОЙ РЕКЛАМОЙ.</p>
                <p>3. ПРОЧИЕ УСЛОВИЯ</p>
                <p>3.1. НИЧТО В СОГЛАШЕНИИ НЕ МОЖЕТ ПОНИМАТЬСЯ КАК УСТАНОВЛЕНИЕ МЕЖДУ ПОЛЬЗОВАТЕЛЕМ И АДМИНИСТРАЦИИ
                    САЙТА АГЕНТСКИХ ОТНОШЕНИЙ, ОТНОШЕНИЙ ТОВАРИЩЕСТВА, ОТНОШЕНИЙ ПО СОВМЕСТНОЙ ДЕЯТЕЛЬНОСТИ, ОТНОШЕНИЙ
                    ЛИЧНОГО НАЙМА, ЛИБО КАКИХ-ТО ИНЫХ ОТНОШЕНИЙ, ПРЯМО
                    НЕ ПРЕДУСМОТРЕННЫХ СОГЛАШЕНИЕМ.</p>
                <h2>Правила для пользователя</h2>
                <p>1. ОБЩИЕ УСЛОВИЯ</p>
                <p>1.1. НАСТОЯЩЕЕ СОГЛАШЕНИЕ ЯВЛЯЕТСЯ ПУБЛИЧНОЙ ОФЕРТОЙ. ПОЛУЧАЯ ДОСТУП К МАТЕРИАЛАМ САЙТА ПОЛЬЗОВАТЕЛЬ
                    СЧИТАЕТСЯ ПРИСОЕДИНИВШИМСЯ К НАСТОЯЩЕМУ СОГЛАШЕНИЮ.</p>
                <p>1.2. АДМИНИСТРАЦИЯ САЙТА ВПРАВЕ В ЛЮБОЕ ВРЕМЯ В ОДНОСТОРОННЕМ ПОРЯДКЕ ИЗМЕНЯТЬ УСЛОВИЯ НАСТОЯЩЕГО
                    СОГЛАШЕНИЯ. ТАКИЕ ИЗМЕНЕНИЯ ВСТУПАЮТ В СИЛУ ПО ИСТЕЧЕНИИ 3 (ТРЕХ) ДНЕЙ С МОМЕНТА РАЗМЕЩЕНИЯ НОВОЙ
                    ВЕРСИИ СОГЛАШЕНИЯ НА САЙТЕ. ПРИ НЕСОГЛАСИИ ПОЛЬЗОВАТЕЛЯ
                    С ВНЕСЕННЫМИ ИЗМЕНЕНИЯМИ ОН ОБЯЗАН ОТКАЗАТЬСЯ ОТ ДОСТУПА К САЙТУ, ПРЕКРАТИТЬ ИСПОЛЬЗОВАНИЕ
                    МАТЕРИАЛОВ И СЕРВИСОВ САЙТА.</p>
                <p>2. ОБЯЗАТЕЛЬСТВА ПОЛЬЗОВАТЕЛЯ</p>
                <p>2.1. ИСПОЛЬЗОВАНИЕ МАТЕРИАЛОВ САЙТА БЕЗ СОГЛАСИЯ ПРАВООБЛАДАТЕЛЕЙ НЕ ДОПУСКАЕТСЯ. ДЛЯ ПРАВОМЕРНОГО
                    ИСПОЛЬЗОВАНИЯ МАТЕРИАЛОВ САЙТА НЕОБХОДИМО ЗАКЛЮЧЕНИЕ ЛИЦЕНЗИОННЫХ ДОГОВОРОВ (ПОЛУЧЕНИЕ ЛИЦЕНЗИЙ) ОТ
                    ПРАВООБЛАДАТЕЛЕЙ.</p>
                <p>2.2. ПРИ ЦИТИРОВАНИИ МАТЕРИАЛОВ САЙТА, ВКЛЮЧАЯ ОХРАНЯЕМЫЕ АВТОРСКИЕ ПРОИЗВЕДЕНИЯ, ССЫЛКА НА САЙТ
                    ОБЯЗАТЕЛЬНА</p>
                <p>2.3. ПОЛЬЗОВАТЕЛЬ ПРЕДУПРЕЖДЕН О ТОМ, ЧТО АДМИНИСТРАЦИЯ САЙТА НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА ПОСЕЩЕНИЕ И
                    ИСПОЛЬЗОВАНИЕ ИМ ВНЕШНИХ РЕСУРСОВ, ССЫЛКИ НА КОТОРЫЕ МОГУТ СОДЕРЖАТЬСЯ НА САЙТЕ.</p>
                <p>2.4. ПОЛЬЗОВАТЕЛЬ СОГЛАСЕН С ТЕМ, ЧТО АДМИНИСТРАЦИЯ САЙТА НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ И НЕ ИМЕЕТ ПРЯМЫХ
                    ИЛИ КОСВЕННЫХ ОБЯЗАТЕЛЬСТВ ПЕРЕД ПОЛЬЗОВАТЕЛЕМ В СВЯЗИ С ЛЮБЫМИ ВОЗМОЖНЫМИ ИЛИ ВОЗНИКШИМИ ПОТЕРЯМИ
                    ИЛИ УБЫТКАМИ, СВЯЗАННЫМИ С ЛЮБЫМ СОДЕРЖАНИЕМ
                    САЙТА, РЕГИСТРАЦИЕЙ АВТОРСКИХ ПРАВ И СВЕДЕНИЯМИ О ТАКОЙ РЕГИСТРАЦИИ, ТОВАРАМИ ИЛИ УСЛУГАМИ,
                    ДОСТУПНЫМИ НА ИЛИ ПОЛУЧЕННЫМИ ЧЕРЕЗ ВНЕШНИЕ САЙТЫ ИЛИ РЕСУРСЫ ЛИБО ИНЫЕ КОНТАКТЫ ПОЛЬЗОВАТЕЛЯ, В
                    КОТОРЫЕ ОН ВСТУПИЛ, ИСПОЛЬЗУЯ РАЗМЕЩЕННУЮ НА САЙТЕ ИНФОРМАЦИЮ
                    ИЛИ ССЫЛКИ НА ВНЕШНИЕ РЕСУРСЫ.</p>
                <p>2.5. ПОЛЬЗОВАТЕЛЬ ПРИНИМАЕТ ПОЛОЖЕНИЕ О ТОМ, ЧТО ВСЕ МАТЕРИАЛЫ И СЕРВИСЫ САЙТА ИЛИ ЛЮБАЯ ИХ ЧАСТЬ
                    МОГУТ СОПРОВОЖДАТЬСЯ РЕКЛАМОЙ. ПОЛЬЗОВАТЕЛЬ СОГЛАСЕН С ТЕМ, ЧТО АДМИНИСТРАЦИЯ САЙТА НЕ НЕСЕТ
                    КАКОЙ-ЛИБО ОТВЕТСТВЕННОСТИ И НЕ ИМЕЕТ КАКИХ-ЛИБО ОБЯЗАТЕЛЬСТВ
                    В СВЯЗИ С ТАКОЙ РЕКЛАМОЙ.</p>
                <p>3. ПРОЧИЕ УСЛОВИЯ</p>
                <p>3.1. НИЧТО В СОГЛАШЕНИИ НЕ МОЖЕТ ПОНИМАТЬСЯ КАК УСТАНОВЛЕНИЕ МЕЖДУ ПОЛЬЗОВАТЕЛЕМ И АДМИНИСТРАЦИИ
                    САЙТА АГЕНТСКИХ ОТНОШЕНИЙ, ОТНОШЕНИЙ ТОВАРИЩЕСТВА, ОТНОШЕНИЙ ПО СОВМЕСТНОЙ ДЕЯТЕЛЬНОСТИ, ОТНОШЕНИЙ
                    ЛИЧНОГО НАЙМА, ЛИБО КАКИХ-ТО ИНЫХ ОТНОШЕНИЙ, ПРЯМО
                    НЕ ПРЕДУСМОТРЕННЫХ СОГЛАШЕНИЕМ.</p>
            </div>
        </section>
    );
};

export default PolicyPage;